# Chapter 1 : Work with Database

Note : we usually use CAPITALIZED text to seperate SQL syntax from others (such as `<veriable_name>`)

Now, **start the SQL commend line interface** using **`mysql-ctl cli`** commend on the terminal

### - SHOW DATABASES

use `SHOW DATABASES;` to show all the existing database in the server

### - CREATE DATABASE

use `CREATE DATABASE <name>;` to create a new database

### - DROP DATABASE
**WARNING**: Be extremely careful when using commend!

use `DROP DATABASE <name>;` to **delete** the whole database

### - USE DatabaseName

use `USE <database_name>;` to run a database

### - SELECT database()
use `SELECT database();` to check what database are we currently running

<br><br>

#  Chapter 2 : Work with Tables
There is a bunch of tables in a database. This is where the data is store.

### Data Types
In SQL, there is a bunch of data types, and must be specified when you create the columns (or header)

   **Numeric Type**
    - INT (e.g. 12, 0, -999, 31415926, )
    - DECIMAL

   **Text Type**
    - VARCHAR(1-255) - a variable-length string (e.g. 'dog', 'asdfhsufhoad', '9', 'Hello World!')
 
   **Date Type**
    - DATETIME
    - TIMESTAMP

**Example** - A tweet table

 1. User Name: `userName - VARCHAR(15)`
 2. Tweet Content: `tweetContent - VARCHAR(140)`
 3. Number of favorites: `likes - INT`

### - Create Table
In convention, we use **plural** to name the table. <br>

Use the following syntex to create a table: <br>
> `CREATE TABLE <table_name> 
    (
        <column_name>   <DATA_TYPE>,
        <column_name>   <DATA_TYPE>
    );`

For example

> `CREATE TABLE tweets 
    (
        userName       VARCHAR(15),
        tweetContent   VARCHAR(140),
        likes          INT
    );`

### - SHOW TABLES
use `SHOW TABLES;`to check all tables in the database

### - SHOW COLUMNS FROM TableName
use `SHOW COLUMNS FROM <Table_Name>;` or `DESC <Table_Name>;` to get the all columns and data types in the table.<br>
The result is identical.

### - DROP TABLE TableName
use `DROP TABLE <Table_Name>;` to delete the entire table

<br><br>

# Chapter 3 : Work with Data

### - INSERT INTO

use the following syntex to insert a line of data into a table:
>` INSERT INTO <table_name> (<column_name_1>, <column_name_2>, ...)
 VALUES (<value_1>, <value_2>, ...);`

and, when inserting multiple data:
>` INSERT INTO <table_name> (<column_name_1>, <column_name_2>, ...)
 VALUES (<value_1>, <value_2>, ...),
       (<value_1>, <value_2>, ...),
       (<value_1>, <value_2>, ...);`



Note: **ORDER MATTERS!**

### - SHOW WARNINGS

When there's a problem while inserting data (e.g. string is too long, wrong data type), it will tell you there's a warning. <br>
To check what the problem was, use `SHOW WARNINGS;` after you're warned.<br><br>
Note that it only works on the previous commend. <br>
For instance, if you use `SELECT` immediately after inserting data. `SHOW WARNINGS;` will show *empty*.

### - Null
Unknown Value

When using `DESC <table_name>;` What does the *YES* under **NULL** mean?
It means it can accept *Null* as a value.

So, to prevent that, use `NOT NULL` when specifying the data type.
For example:

> `CREATE TABLE tweets 
    (
        userName       VARCHAR(15)    NOT NULL,
        tweetContent   VARCHAR(140)   NOT NULL,
        likes          INT            NOT NULL
    );`

However, if you insert a empty value that does not allow null value, and you didn't set an default value, you will end up with an ***empty string***.

### - Default Values

If the value inserting is not specified, it will be replaced with the default value.

For instance:

> `CREATE TABLE tweets 
    (
        userName       VARCHAR(15)    DEFAULT   'unknown user',
        tweetContent   VARCHAR(140)   DEFAULT   'no content',
        likes          INT            DEFAULT   '0'
    );`

### - Combining NOT NULL with DEFAULT
You might be wondering, if we already specified the `DEFAULT` value, why do we still need to specify `NOT NULL`, since we already have a `DEFAULT` value?
The answer is that, when inserting data, we can still specify the value to be `NULL`.
So, to prevent that from happening, this is what we'll write:

> `CREATE TABLE tweets 
    (
        userName      VARCHAR(15)     NOT NULL    DEFAULT  'unknown user',
        tweetContent  VARCHAR(140)    NOT NULL    DEFAULT  'no content',
        likes         INT             NOT NULL    DEFAULT  '0'
    );`

### - Primary Key

A unique identifier. What it does is that it specify the columns that every value in that columns **must be unique.**

   **Why do we need key?**<br>
     To prevent identical data, such as ID, user_name in account table.

   **Why should we prevent identical data?**<br>
     So we can refer to the data we want **SPECIFICALLY**.

Use the following lines:

> `CREATE TABLE tweets1 
    (
        tweet_id      INT             NOT NULL,
        userName      VARCHAR(15)     NOT NULL    DEFAULT  'unknown user',
        tweetContent  VARCHAR(140)    NOT NULL,
        likes         INT,
        PRIMARY KEY (tweet_id)
    );`

However, it's impractical to specify the id every time, so we can use `AUTO_INCREMENT` to get around this:

> `CREATE TABLE tweets1 
    (
        tweet_id      INT             NOT NULL    AUTO_INCREMENT,
        userName      VARCHAR(15)     NOT NULL    DEFAULT  'unknown user',
        tweetContent  VARCHAR(140)    NOT NULL,
        likes         INT,
        PRIMARY KEY ('tweet_id')
    );`
    
Now, we on longer need to specify the id every single time.

**Exercise:**

`CREATE TABLE employees
    (
        id               INT             NOT NULL      AUTO_INCREMENT,
        last_name        VARCHAR(255)    NOT NULL,
        first_name       VARCHAR(255)    NOT NULL,
        middle_name      VARCHAR(255),
        age              INT             NOT NULL,
        current_status   VARCHAR(100)    NOT NULL      DEFAULT 'employed',
        PRIMARY KEY (id)
    )`
    
**Result**

*mysql> `DESC employees;`* <br><br>
` +----------------+--------------+------+-----+----------+----------------+
 | Field          | Type         | Null | Key | Default  | Extra          |
 +----------------+--------------+------+-----+----------+----------------+
 | id             | int(11)      | NO   | PRI | NULL     | auto_increment |
 | last_name      | varchar(255) | NO   |     | NULL     |                |
 | first_name     | varchar(255) | NO   |     | NULL     |                |
 | middle_name    | varchar(255) | YES  |     | NULL     |                |
 | age            | int(11)      | NO   |     | NULL     |                |
 | current_status | varchar(100) | NO   |     | employed |                |
 +----------------+--------------+------+-----+----------+----------------+`

<br><br>

# Chapter 4 : The Basic of "CRUD"

**CRUD** stands for:
- **C**reate
- **R**ead
- **U**pdate
- **D**elete

which are the most commonly used operations. 
And we have already covered the **C**reate part, so let's focus on the next thing – **R**ead.

## 4.1 Read Data

### - SELECT *
use `SELECT <fields_names> FROM <table_name>` to read the data.


#### All Fields

Use `*` to find all fields(columns)

`SELECT * FROM <table_name>;`


#### Specified Fields

Use `<column_name>` to specify the fields you want

` SELECT <column_name_1>, <column_name_2>
 FROM <table_name>;`
 
Note that the order of `<column_name>` matters.

### - WHERE clause

Use `WHERE` to get the information that fits the **CONDITION**, or you can say that **fits the description**.

>*e.g.*
>1. Show all cats that are 4 years old. <br>
>`SELECT * FROM cats
 WHERE age = 4;`
><br><br>
>2. Show all cats that are called 'Egg'. <br>
>*Note that it doesn't care about the uppercase or lowercase characters* <br>
>`SELECT * FROM cats
 WHERE name = 'Egg';`
>

### - AS (Aliases)
Use `AS` to specify the columns' names, so it's more 'intepretable' to human.

> *e.g.* cat_id --> **ID**, breed --> **Type of cat**, name --> **Cat's Name** <br>
> `SELECT cat_id AS 'ID', breed AS 'Type of cat', name AS 'Cat\'s Name'` <br>
> `FROM cats`

## 4.2 Update Data
Alter existing data.

### - UPDATE ... SET ...
Use the following syntax to update the existing value with `<new_value>` <br>
>`UPDATE <table_name> SET <column_name> = <new_value>
WHERE <where_to_perform>;` 

*e.g.*
> 1. update the breed name 'Tabby' to 'Shorthair'
>`UPDATE cats SET breed = 'Shorthair'
WHERE breed = 'Tabby';`
>
> 2. update the Misty's age to 14
> `Update cats SET age = 14
WHERE name = 'Misty';`

#### IMPORTANT NOTE:
Use **`SELECT` BEFORE** using `UPDATE` to check if you're updating the right data!

> For instance, use <br>
> **` SELECT breed
 FROM cats
 WHERE name = 'Ringo';`**
> <br><br>and before using<br>
> **` UPDATE cats
 SET breed = 'British Shorthair'
 WHERE name = 'Ringo';`**

## 4.3 Delete Data
Delete **entire row** from the table.

### - DELETE FROM
This is very similar to `SELECT`, just replace it with `DELETE` instead, and no field need to be specified.<br>
Concretely, write in the following form:
>` DELETE FROM <table_name>
 WHERE <condition>;`

#### IMPORTANT NOTE:
Just like update, use **`SELECT` BEFORE** using `DELETE` to check if you're deleting the right data!

> For instance, use <br>
> **` SELECT *
 FROM cats
 WHERE name = 'Egg';`**
> <br><br>and before using<br>
> **` DELETE FROM cats
 WHERE name = 'Egg';`**
 
#### ALSO IMPORTANT:
`DELETE FROM <table_name>` will delete **ALL ENTRIES** in the table, without having to rebuild the table like the `DROP` function.

### - CRUD Exercise

**Create some data**

Create Database called 'shirts_db'
> `CREATE DATABASE Shirts_db`

Create shirts table in the db
> `USE shirts_db`

>`CREATE TABLE shirts
 ( shirt_id    INT NOT NULL AUTO_INCREMENT,
   article     VARCHAR(255), 
   color       VARCHAR(255),
   shirt_size  VARCHAR(10),
   last_worn   INT,
   PRIMARY KEY (shirt_id)
 );`

Create some data for the table

> Insert multiple entries of data in a single command: <br> <br>
>`INSERT INTO shirts (article, color, shirt_size, last_worn)
 VALUES ('t-shirt', 'white', 'S', 10),
        ('t-shirt', 'green', 'S', 200),
	    ('polo shirt', 'black', 'M', 10),
	    ('tank top', 'blue', 'S', 50),
	    ('t-shirt', 'pink', 'S', 0),
	    ('polo shirt', 'red', 'M', 5),
	    ('tank top', 'white', 'S', 200),
	    ('tank top', 'blue', 'M', 15);`

> Insert one entry of data: <br> <br>
> `INSERT INTO shirts (article, color, shirt_size, last_worn)
 VALUE ('polo shirt', 'purple', 'M', 50);`

<br>

**Read some data**

Show article and shirt size
> `SELECT article, shirt_size FROM shirts;`

Show all fileds except for shirt_id
>`SELECT article, color, shirt_size, last_worn
 FROM shirts
 WHERE shirt_size = 'M';`

<br>

**Update some data**

Update all 
>`UPDATE shirts
 SET shirt_size = 'L'
 WHERE article = 'polo shirt';`

Update last worn 15 to 0
> `UPDATE shirts
 SET last_worn = 0
 WHERE last_worn = 15;`

Update shirt size to XS and color to off white to all white shirts
> `UPDATE shirts
 SET shirt_size = 'XS', color = 'off white'
 WHERE color = 'white';`

<br>

**Delete some data**

Delete old shirts that was last worn 200 days (exactly) ago
> `DELETE FROM shirts
 WHERE last_worn = 200;`

Change of taste, delete all tank tops
> `DELETE FROM shirts
 WHERE article = 'tank top';`

Delete all entries
> `DELETE FROM shirts;`

Delete the table
> `DROP table shirts;`

<br><br>

# Chapter 5 : Run SQL Files
To run SQL codes, we don't always have to write cmd codes over and over. <br>
Instead we can save them as as files and use `SOURCE <file_name>;` (*e.g.* `SOURCE test.sql;`) to run saved code in the file.

<br><br>

# Chapter 6 : The String Functions
Source : https://dev.mysql.com/doc/refman/8.0/en/string-functions.html

### - CONCAT()
Combine multiple columns and strings. <br>
`CONCAT(<column_name_1>, <column_name_2>, '<some strings>', ...);` <br>
*e.g.*
>`SELECT CONCAT(first_name, ' ' ,last_name) AS 'Full Name';`<br>

*e.g.*
>`SELECT CONCAT('Hello', ' ' ,'World');`

### - CONCAT_WS()
Concate **with SEPARATOR** (for CVS file, for example).<br>
Simply put the separator in the first item of the list of strings/columns: <br>
`CONCAT_WS(`**`<'seperator'>`**` , <column_name_1> , <column_name_2> , '<some strings>', ...);`

### - SUBSTRING() & SUBSTR()
Select only parts of strings that you want:<br>
`SELECT SUBSTRING('<text>', <index_of_the_starting_character>, <length_of_characters>);`<br>
*Note that, in SQL, index starts with 1, instead of 0 like in Python.* <br>
*`<Length of charaters>` means that it includes the starting character. Please refer to the following example.*

*e.g.* <br>

<table style="border:3px #cccccc solid;" cellpadding="10" border='1'>
  <tr style="font-wright:bold;text-align:center;">
    <th>'H'</th>
    <th>'e'</th>
    <th>'l'</th>
    <th>'l'</th>
    <th>'o'</th>
    <th>' '</th>
    <th>'W'</th>
    <th>'o'</th>
    <th>'r'</th>
    <th>'l'</th>
    <th>'d'</th>
  </tr>
  <tr style="text-align:center;">
    <td>1</td>
    <td>2</td>
    <td>3</td>
    <td>4</td>
    <td>5</td>
    <td>6</td>
    <td>7</td>
    <td>8</td>
    <td>9</td>
    <td>10</td>
    <td>11</td>
  </tr>
  <tr style="text-align:center;">
    <td>-11</td>
    <td>-10</td>
    <td>-9</td>
    <td>-8</td>
    <td>-7</td>
    <td>-6</td>
    <td>-5</td>
    <td>-4</td>
    <td>-3</td>
    <td>-2</td>
    <td>-1</td>
  </tr>
</table>


Start at the **2nd** character ('e') with a length of 4
> `SELECT SUBSTRING('Hello World', 2, 4);` <br>
> return **`'ello'`**

Start at **7th** character, **length not specified** (which means **ALL** the characters after the starting character)
> `SELECT SUBSTRING('Hello World', 7);` <br>
> return **`'World'`**

Start at **-7th** character (**counting backword**), **length not specified** (which means **ALL** the characters **AFTER** the starting character)
> `SELECT SUBSTRING('Hello World', -7);` <br>
> return **`'o World'`**

Combining `CONCAT()` and `SUBSTRING()` together <br>
>`SELECT CONCAT( SUBSTRING(title, 1, 15) , ' ...') AS 'Short Title'
 FROM books;`

### - REPLACE()
`REPLACE` some the specified strings with the alternative: <br>
`SELECT REPLACE ('<text>', '<what_to_replace>', '<alternative>');`

*e.g.*

Replace `'o'` with `'0'` <br>
> `SELECT REPLACE ('Hello World', 'o', '0');` <br>
> return `'Hell0 W0rld'`

Replace `' '` with `' and '` <br>
> `SELECT REPLACE ('Cheese bread coffee milk', ' ', ' and ');` <br>
> return `'Cheese and bread and coffee and milk'`

Replace `'e'` with `'3'` <br>
> `SELECT REPLACE ('America', 'e', '3');`
> return `'Am3rica'`

Combine `REPLACE()` and `SUBSTRING()`
> `SELECT SUBSTRING(REPLACE(title, 'e', '3'), 1, 10) AS 'Weird Strings'
FROM books;`

### - REVERSE()
`REVERSE()` Reverse your strings character by character.<br>

*e.g.*

> `SELECT REVERSE('Hello World');` <br>
> return `dlroW olleH`

### - CHAR_LENGTH()
Count characters in the given string using:
`SELECT CHAR_LENGTH(<text>);`

*e.g.*

Count the number of characters in 'Hello World'
> `SELECT CHAR_LENGTH('Hello World');`
> return `11`

Count the number of characters of book title
> `SELECT CHAR_LENGTH(title) FROM books;`

Combining `CHAR_LENGTH()` and `CONCAT()`
> `SELECT CONCAT(author_lname, ' is ', CHAR_LENGTH(author_lname), 'characters long')
FROM books;`

*If you want your SQL codes to look better, use this formatter: https://sql-format.com/*

### - UPPER() and LOWER()
Change **ALL** the string to upper case or lower case using
`SELECT UPPER('<text>');` or `SELECT LOWER('<text>');`

*e.g.*

Upper case 'Hello World'
> `SELECT UPPER('Hello World');`
> return `'HELLO WORLD'`

Lower case 'Hello World'
> `SELECT LOWER('Hello World');`
> return `'hello world'`

<br>

Note that `UPPER()` and `LOWER()` only takes **ONE argument**.<br>
So `UPPER(CONCAT('<text>','<text>'))` works, while `CONCAT(UPPER('<text>','<text>'))` does **not**. <br>
However, you can do it like this `CONCAT(UPPER('<text>'), UPPER('<text>'))`

<br><br>

# Chapter 7 : Refining Selection

### - DISTINCT
Get unique value (get rid of the duplcicate values).
`SELECT DISTINCT <field_name>;`

*e.g.*
> `SELECT DISTINCT released_year FROM books;` <br>
> `SELECT DISTINCT author_lname FROM books;`

Selecting distinct data that consider multiple columns <br>
we can combine it with `CONCAT()`: <br>
> `SELECT DISTINCT CONCAT(author_fname, ' ', author_lname) FROM books;` <br>
> return **ONE** column that combines the specified fields.

or, simply utilize the distinct function: <br>
> `SELECT DISTINCT author_fname, author_lname FROM books;` <br>
> return **TWO columns** – `<author_fname>` and `<author_lname>`.

### - ORDER BY
Sorting result (to find best seller, for example), using:<br>
`SELECT <field_name>
 FROM <table_name>
 ORDER BY <field_name> <method>;`

Note that `<method>` is default as **ascending** (`ASC`), <br>
to specify a **descending** order, use `DESC`.

Also, you don't need to select the field that you want to order by.

<br>

*e.g.*

Alphabetical
>`SELECT title FROM books` <br>
> **`ORDER BY title;`**

Numerical - books that has the most stock
> `SELECT stock_quantity FROM books` <br>
> **`ORDER BY stock_quantity DESC;`**

SELECT multiple columns
> `SELECT title, author_fname, author_lname FROM books` <br>
> **`ORDER BY 2;`** <br>
> *where **2** means the **second field** (`author_fname`)*

ORDER BY multiple columns
*first sort by the author's last name (`author_lname`), then sort by author's first name (`author_fname`)*
> `SELECT author_fname, author_lname FROM books` <br>
> **`ORDER BY author_lname, author_fname;`** <br>

or
> `SELECT author_fname, author_lname FROM books` <br>
> **`ORDER BY 2, 1;`** <br>

### - LIMIT
Limiting the entries of result. For example, get the first 3 result. <br>
`SELECT <field_name>
 FROM <table_name>
 LIMIT <starting_point>, <number_of_entries>;`  <br>
where `<starting_point>` starts at 0

Usually used with ORDER BY: <br>
`SELECT <field_name>
 FROM <table_name>
 ORDER BY <field_name> <method>
 LIMIT <starting_point>,  <number_of_entries>;` <br>

*e.g.*

Select 5 latest books
> `SELECT title, released_year
 FROM books
 ORDER BY released_year DESC` <br>
> **`LIMIT 5;`** 

Select 3-7 latest books
> `SELECT title, released_year
 FROM books
 ORDER BY released_year DESC` <br>
> **`LIMIT 2, 5;`** 


Select all latest books except first 5
> `SELECT title, released_year
 FROM books
 ORDER BY released_year DESC` <br>
> **`LIMIT 4, 123456789098;`** <br>
> where the `<number_of entries>` (`123456789098`) is just a random gigantic number

### - LIKE
Unlike the `WHERE` method that we went through, which finds you the **exact match**, <br>
`LIKE` allows us to find values that we only know parts of information. <br>

For instance, if we want to find all Harry Potter books, <br>
instead of typing the exact titles that we probably don't remember <br>
(*e.g.* `WHERE title = 'Harry Potter - The Philosopher's Stone'`), <br>
we can use `LIKE` function to find all books that has 'Harry Potter' in the books' title <br>
(*e.g.* `WHERE title LIKE '%Harry Potter%'`).

**Symbols that represent any character**
- `%` - The percent sign represents **zero**, **one**, or **multiple** characters
- `_` - The underscore represents a **single character** <br>
    e.g. find phone number : (235)234-4567 --> `LIKE '(___)___-____'`

<br>

*e.g.*

Select book titles that **start with 'The'**
> `SELECT title FROM books` <br>
> **`WHERE title LIKE 'The%'`**

Select book titles that **contain the word 'the'**
> `SELECT title FROM books` <br>
> **`WHERE title LIKE '%the%'`**

Find books stock quantity that is 4 figures (4-digit)
> `SELECT stock_quantity FROM books` <br>
> **`WHERE stock_quantity LIKE '____'`**

Find book titles that has a percent sign `%`.
> (use escape sign – **backslash `\`** with percent, like `'\%'` an `'\_'` ) <br>
> `SELECT title FROM books` <br>
> **`WHERE title LIKE '%\%%'`**

Select book titles **ends with 'd' and a character behind it.**
> `SELECT title FROM books` <br>
> **`WHERE title LIKE '%d_'`**

<br><br>

# Chpater 8 : The Aggregate Function

 ~ to be continued ~